import { v4 } from 'uuid';

const articleDataSource = [
    {
        id: v4(),
        title: '赤壁赋',
        text: '客亦知夫水与月乎？逝者如斯，而未尝往也；盈虚者如彼，而卒莫消长也。盖将自其变者而观之，则天地曾不能以一瞬；自其不变者而观之，则物与我皆无尽也，而又何羡乎！且夫天地之间，物各有主，苟非吾之所有，虽一毫而莫取。惟江上之清风，与山间之明月，耳得之而为声，目遇之而成色，取之无禁，用之不竭，是造物者之无尽藏也，而吾与子之所共适。'
    },
    {
        id: v4(),
        title: '滕王阁序',
        text: '时维九月，序属三秋。潦水尽而寒潭清，烟光凝而暮山紫。俨骖騑于上路，访风景于崇阿；临帝子之长洲，得天人之旧馆。层峦耸翠，上出重霄；飞阁流丹，下临无地。鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，即冈峦之体势。\n' +
            '披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。闾阎扑地，钟鸣鼎食之家；舸舰弥津，青雀黄龙之舳。云销雨霁，彩彻区明。落霞与孤鹜齐飞，秋水共长天一色。渔舟唱晚，响穷彭蠡之滨；雁阵惊寒，声断衡阳之浦。'
    },
    {
        id: v4(),
        title: '醉花间',
        text: '晴雪小园春未到，池边梅自早。高树鹊衔巢，斜月明寒草。\n' +
            '山川风景好，自古金陵5道，少年看却老。相逢莫厌6醉金杯，别离多，欢会少。'
    },
    {
        id: v4(),
        title: '将进酒',
        text: '君不见黄河之水天上来，奔流到海不复回。\n' +
            '君不见高堂明镜悲白发，朝如青丝暮成雪。\n' +
            '人生得意须尽欢，莫使金樽空对月。\n' +
            '天生我材必有用，千金散尽还复来。\n' +
            '烹羊宰牛且为乐，会须一饮三百杯。\n' +
            '岑夫子，丹丘生，将进酒，杯莫停。\n' +
            '与君歌一曲，请君为我倾耳听。(倾耳听 一作：侧耳听)\n' +
            '钟鼓馔玉不足贵，但愿长醉不愿醒。\n' +
            '古来圣贤皆寂寞，惟有饮者留其名。\n' +
            '陈王昔时宴平乐，斗酒十千恣欢谑。\n' +
            '主人何为言少钱，径须沽取对君酌。\n' +
            '五花马、千金裘，呼儿将出换美酒，与尔同销万古愁。\n'
    },
];

export { articleDataSource };